<template>
  <footer>
    <div class="container">
      <div class="mobile-line" v-if="$route.path !== '/'"></div>

      <div class="main-wrap">
        <div class="main-wrap-item">
          <nuxt-link class="flex-align-center logo-wrap" exact no-prefetch to="/">
            <svg class="logo" fill="none" height="40" viewBox="0 0 40 40" width="40" xmlns="http://www.w3.org/2000/svg">
              <g clip-path="url(#clip0_601_2314)">
                <path d="M0.1 39.9V0.1H39.9V39.9H0.1Z" fill="#0B0B0B" stroke="white" stroke-width="0.2"/>
                <path clip-rule="evenodd"
                      d="M4.60477 4.22729L16.8551 35.4149H21.5354L35.3819 4.22729H29.8541L17.8726 31.4666L7.33496 4.22729H4.60477Z"
                      fill="#00A689"
                      fill-rule="evenodd"/>
                <path
                  d="M21.6029 35.5188H16.7843L4.45227 4.12347H7.40614L17.8787 31.1947L29.7863 4.12347H35.5418L21.6029 35.5188ZM16.926 35.311H21.4678L35.2221 4.3313H29.922L17.8665 31.7387L7.26371 4.3313H4.75719L16.926 35.311Z"
                  fill="white"/>
                <path clip-rule="evenodd" d="M35.5481 23.3376L30.1349 35.534H35.5481V23.3376Z" fill="white"
                      fill-rule="evenodd"/>
                <path clip-rule="evenodd" d="M27.8914 4.12146L17.9955 26.7979L13.8424 16.0423L18.7864 4.12146H27.8914Z"
                      fill="white" fill-rule="evenodd"/>
                <path clip-rule="evenodd" d="M4.47983 10.5192L14.0954 35.5353H4.47983V10.5192Z" fill="white"
                      fill-rule="evenodd"/>
              </g>
              <defs>
                <clipPath id="clip0_601_2314">
                  <rect fill="white" height="40" width="40"/>
                </clipPath>
              </defs>
            </svg>
            <svg class="logo-word" fill="none" height="40" viewBox="0 0 154 40" width="154"
                 xmlns="http://www.w3.org/2000/svg">
              <g clip-path="url(#clip0_601_2305)">
                <path
                  d="M11.1247 39.9679H6.59864L6.56979 4.80118H0L1.80927 0.0331421H19.8909V4.80118H11.0958L11.1247 39.9679Z"
                  fill="white"/>
                <path
                  d="M57.8838 35.2695L25.7142 35.1998L25.7102 23.469C25.7679 19.1763 27.1263 17.0238 29.7927 17.0238C32.2907 17.0238 33.54 19.0549 33.54 23.1175V33.3063H38.212V21.5576C38.212 19.2499 37.6118 17.3162 36.4114 15.7562C35.2111 14.1963 33.6051 13.4161 31.5936 13.4161C28.9026 13.4161 26.9411 14.1625 25.7082 15.6555L25.7051 6.74102V0.0101318H20.9845V33.3066H20.9916V35.1998H12.1962V39.9679H59.6749L57.8838 35.2695Z"
                  fill="white"/>
                <path
                  d="M117.057 16.4326C115.387 14.4177 113.286 13.41 110.755 13.41C108.062 13.41 106.035 14.2064 104.672 15.7988V14.0438H99.9515L99.9485 35.2123L76.5008 35.1454L74.8506 35.1887L72.9349 35.163L68.8232 35.1522L70.6016 39.9222L99.9478 39.981V39.9858H102.949L104.725 35.235L104.77 31.4962C105.873 33.121 107.836 33.9336 110.658 33.9336C113.286 33.9336 115.427 32.9426 117.082 30.9598C118.737 28.9773 119.564 26.5074 119.564 23.5498C119.564 20.8197 118.729 18.4471 117.057 16.4322V16.4326ZM113.335 28.0839C112.394 29.2538 111.096 29.8389 109.441 29.8389C108.046 29.8389 106.813 29.2051 105.743 27.9376C104.672 26.67 104.137 25.2321 104.137 23.6232C104.137 22.0142 104.64 20.5925 105.646 19.3574C106.651 18.1223 107.917 17.5051 109.441 17.5051C111.096 17.5051 112.394 18.1145 113.335 19.3334C114.275 20.5523 114.746 21.9902 114.746 23.6478C114.746 25.4352 114.276 26.9141 113.335 28.0839Z"
                  fill="white"/>
                <path
                  d="M93.9829 23.654C93.9829 21.8665 93.48 20.3958 92.4742 19.2422C91.4684 18.0885 90.1788 17.5116 88.6054 17.5116C87.032 17.5116 85.7504 18.0723 84.7608 19.1935C83.7714 20.3147 83.2766 21.8016 83.2766 23.6543C83.2766 25.507 83.7795 27.0017 84.7853 28.1394C85.791 29.2768 87.0887 29.8457 88.6786 29.8457C90.2684 29.8457 91.55 29.2931 92.5232 28.1881C93.4968 27.0831 93.9832 25.5719 93.9832 23.6543M98.0711 33.3066H93.4478V31.5517C92.0851 33.1441 90.0574 33.9404 87.3648 33.9404C84.6722 33.9404 82.5228 32.9004 80.9168 30.8202C79.3108 28.7401 78.508 26.3026 78.508 23.5079C78.508 20.7132 79.3273 18.3323 80.9654 16.366C82.6039 14.3998 84.7044 13.4165 87.2675 13.4165C89.9926 13.4165 92.0529 14.2291 93.4478 15.8539V14.0503H98.0711V33.3066Z"
                  fill="white"/>
                <path
                  d="M79.4131 0.0131826L70.4295 25.0672L61.505 0.0550964H56.2822L37.0039 0L35.3533 0.0432659L33.438 0.0175768L26.7485 0V4.76804L57.874 4.83057L68.4341 33.306H71.7919L84.961 0.0131826H79.4131Z"
                  fill="white"/>
                <path
                  d="M135.022 21.5092C135.022 20.1768 134.609 19.0066 133.781 17.9993C132.954 16.9917 131.884 16.488 130.569 16.488C129.255 16.488 128.185 17.016 127.358 18.0723C126.53 19.1286 126.117 20.2741 126.117 21.5092H135.022ZM125.971 24.1417C125.971 25.994 126.376 27.5218 127.187 28.7242C127.999 29.9265 129.118 30.5278 130.545 30.5278C132.784 30.5278 134.211 29.4228 134.828 27.2129L139.459 27.2065C137.999 31.2042 134.925 33.9401 130.545 33.9401C127.625 33.9401 125.298 33.0058 123.562 31.1369C121.826 29.268 120.958 26.8387 120.958 23.8486C120.958 20.6963 121.794 18.1693 123.465 16.268C125.135 14.3666 127.407 13.4161 130.278 13.4161C133.149 13.4161 135.387 14.318 136.993 16.1216C138.599 17.9253 139.402 20.3874 139.402 23.5072V24.141H125.97L125.971 24.1417Z"
                  fill="white"/>
                <path
                  d="M53.4883 21.5096C53.4883 20.1771 53.0746 19.0069 52.2473 17.9996C51.42 16.992 50.3495 16.4884 49.0354 16.4884C47.7213 16.4884 46.6508 17.0164 45.8235 18.0727C44.9962 19.129 44.5825 20.2745 44.5825 21.5096H53.4883ZM44.4366 24.1421C44.4366 25.9944 44.8422 27.5222 45.6534 28.7245C46.4646 29.9268 47.5837 30.5282 49.0112 30.5282C51.2499 30.5282 52.6774 29.4232 53.2937 27.2133L57.9247 27.2068C56.4647 31.2045 53.391 33.9404 49.0112 33.9404C46.0912 33.9404 43.7636 33.0062 42.0278 31.1373C40.292 29.2684 39.4241 26.8391 39.4241 23.849C39.4241 20.6967 40.2595 18.1697 41.9305 16.2683C43.6012 14.367 45.8724 13.4165 48.7435 13.4165C51.6146 13.4165 53.8533 14.3183 55.4592 16.122C57.0652 17.9256 57.868 20.3877 57.868 23.5076V24.1414H44.4362L44.4366 24.1421Z"
                  fill="white"/>
                <path
                  d="M151.22 13.4165C148.657 13.4165 146.775 14.2939 145.575 16.0489V14.0502H145.551V10.6948V6.78021L116.036 6.79103L114.192 11.4901L140.855 11.5395V14.0502V35.2019H116.53L114.723 40H145.575V24.6291C145.575 19.884 147.23 17.5115 150.539 17.5115C151.378 17.5781 151.777 17.6389 152.578 18.0199L154 14.2385C153.136 13.7061 152.032 13.4165 151.221 13.4165H151.22Z"
                  fill="white"/>
              </g>
              <defs>
                <clipPath id="clip0_601_2305">
                  <rect fill="white" height="40" width="154"/>
                </clipPath>
              </defs>
            </svg>
          </nuxt-link>
          <p class="item-text logo-text">Интернет-магазин электронных сигарет и жидкости для парения.</p>
        </div>

        <div class="main-wrap-item">
          <p class="item-title">
            <b>Категории</b>
          </p>
          <ul class="flex-column">
            <li v-for="(item, id) in categoriesLinks" :key="`category_link_${id}`">
              <nuxt-link class="item-text item-link" exact no-prefetch to="/catalog">
                {{ item }}
              </nuxt-link>
            </li>
          </ul>
        </div>

        <div class="main-wrap-item recommendation">
          <p class="item-title">
            <b>Наши предложения</b>
          </p>
          <ul class="flex-column">
            <li v-for="(item, id) in recommendationLinks" :key="`recommendation_link_${id}`">
              <nuxt-link class="item-text item-link" exact no-prefetch to="/catalog">
                {{ item }}
              </nuxt-link>
            </li>
          </ul>
        </div>

        <div class="main-wrap-item help">
          <p class="item-title"><b>Поддержка</b></p>
          <ul class="flex-column">
            <li v-for="(item, id) in helpsLinks" :key="`help_link_${id}`">
              <nuxt-link class="item-text item-link" exact no-prefetch :to="item.url">
                {{ item.title }}
              </nuxt-link>
            </li>
          </ul>
        </div>

        <div class="main-wrap-item flex-align-end flex-column">
          <a class="tel" href="tel:74742522177">+7 (4742) 522-177</a>
          <div class="social">
            <a href="/">
              <svg class="vk" fill="none" height="13" viewBox="0 0 24 13" width="24" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M23.8727 11.7404C23.8437 11.6809 23.8166 11.6316 23.7914 11.5921C23.375 10.8801 22.5793 10.0062 21.4047 8.97011L21.3799 8.94638L21.3675 8.93474L21.3549 8.92282H21.3423C20.8092 8.44036 20.4716 8.11597 20.3302 7.94989C20.0716 7.63352 20.0137 7.31327 20.155 6.9888C20.2549 6.74364 20.6301 6.22591 21.2797 5.4349C21.6213 5.01567 21.8919 4.6797 22.0918 4.42656C23.5331 2.60743 24.158 1.44498 23.9662 0.93876L23.8918 0.820463C23.8418 0.749243 23.7127 0.68409 23.5046 0.624671C23.2961 0.565377 23.0296 0.555572 22.7047 0.595087L19.106 0.618688C19.0477 0.599075 18.9644 0.600904 18.856 0.624671C18.7477 0.648438 18.6934 0.660364 18.6934 0.660364L18.6308 0.690074L18.5811 0.725767C18.5395 0.749367 18.4936 0.790879 18.4436 0.850213C18.3938 0.909342 18.3523 0.978732 18.3189 1.05781C17.9271 2.01478 17.4817 2.90453 16.9818 3.727C16.6735 4.21743 16.3904 4.64246 16.1319 5.00235C15.8737 5.3621 15.6571 5.62715 15.4822 5.79706C15.3072 5.96713 15.1492 6.10338 15.0073 6.2063C14.8657 6.30927 14.7576 6.35276 14.6826 6.33685C14.6076 6.32094 14.5369 6.30515 14.4699 6.28936C14.3534 6.21814 14.2597 6.12129 14.189 5.99871C14.118 5.87613 14.0702 5.72185 14.0452 5.53598C14.0203 5.35 14.0056 5.19003 14.0014 5.05553C13.9975 4.9212 13.9993 4.73118 14.0078 4.48602C14.0164 4.24074 14.0203 4.07478 14.0203 3.98778C14.0203 3.6872 14.0265 3.36097 14.0389 3.00903C14.0515 2.65708 14.0617 2.37824 14.0702 2.1728C14.0787 1.96716 14.0827 1.7496 14.0827 1.52024C14.0827 1.29087 14.0679 1.11099 14.0389 0.980436C14.0102 0.850047 13.9662 0.723481 13.9081 0.600779C13.8496 0.478202 13.7641 0.383381 13.6519 0.316068C13.5394 0.248837 13.3996 0.195484 13.2333 0.155845C12.7917 0.0609821 12.2294 0.0096659 11.5462 0.00168798C9.99681 -0.0141016 9.00124 0.0808851 8.55971 0.286525C8.38478 0.373409 8.22647 0.492122 8.08493 0.642289C7.93495 0.816349 7.91403 0.911336 8.02231 0.926959C8.52221 0.998055 8.8761 1.16813 9.0844 1.437L9.15946 1.57949C9.21784 1.68229 9.27614 1.86428 9.33448 2.12523C9.39274 2.38616 9.43034 2.67483 9.44687 2.99103C9.48845 3.56847 9.48845 4.06278 9.44687 4.47397C9.40516 4.88533 9.36578 5.20557 9.32818 5.43493C9.29058 5.6643 9.23439 5.85016 9.15946 5.99247C9.0844 6.13484 9.03446 6.22184 9.00942 6.25342C8.98443 6.285 8.9636 6.3049 8.94706 6.31271C8.83877 6.3521 8.72616 6.37218 8.60961 6.37218C8.49288 6.37218 8.35135 6.31674 8.18476 6.20597C8.01824 6.09519 7.8454 5.94303 7.66625 5.74923C7.48712 5.5554 7.2851 5.28452 7.06009 4.93656C6.83526 4.58861 6.60198 4.17737 6.36038 3.70286L6.1605 3.35873C6.03554 3.13733 5.86485 2.81498 5.64826 2.39194C5.43152 1.96874 5.23996 1.55937 5.07342 1.16392C5.00684 0.997846 4.90684 0.871405 4.77358 0.784396L4.71103 0.748703C4.66945 0.717124 4.60271 0.683591 4.51115 0.647857C4.41946 0.612164 4.32378 0.586569 4.22373 0.570819L0.799885 0.594422C0.450012 0.594422 0.21262 0.669672 0.0876214 0.819964L0.0375958 0.891058C0.0126049 0.930658 0 0.993899 0 1.08095C0 1.16796 0.0249909 1.27475 0.0750165 1.40118C0.574835 2.51644 1.11838 3.592 1.70564 4.62804C2.29291 5.66409 2.80323 6.49866 3.2363 7.13099C3.66946 7.76378 4.11099 8.361 4.56087 8.92236C5.01074 9.48393 5.30854 9.84381 5.45424 10.0019C5.60011 10.1603 5.71469 10.2787 5.79798 10.3578L6.11043 10.6425C6.31037 10.8323 6.60395 11.0597 6.99133 11.3246C7.3788 11.5897 7.80776 11.8506 8.27843 12.1078C8.74918 12.3647 9.29685 12.5742 9.9217 12.7363C10.5465 12.8986 11.1546 12.9637 11.7461 12.9323H13.1832C13.4745 12.9084 13.6953 12.8214 13.8454 12.6713L13.8951 12.6118C13.9286 12.5645 13.9599 12.4913 13.9887 12.3925C14.018 12.2937 14.0325 12.1848 14.0325 12.0663C14.024 11.7263 14.0512 11.4198 14.1136 11.147C14.1759 10.8743 14.2468 10.6686 14.3263 10.5302C14.4056 10.3918 14.4951 10.275 14.5948 10.1804C14.6947 10.0855 14.7658 10.0281 14.8076 10.0083C14.8491 9.98836 14.8822 9.97486 14.9072 9.96676C15.1071 9.90352 15.3424 9.96477 15.6134 10.1508C15.8842 10.3367 16.1383 10.5661 16.3758 10.8389C16.6132 11.1119 16.8985 11.4182 17.2316 11.7582C17.5651 12.0983 17.8566 12.3512 18.1063 12.5175L18.3561 12.6599C18.523 12.7548 18.7396 12.8418 19.0063 12.9209C19.2724 13 19.5056 13.0198 19.7058 12.9802L22.9046 12.9329C23.221 12.9329 23.4671 12.8831 23.6417 12.7844C23.8168 12.6855 23.9207 12.5766 23.9542 12.4582C23.9877 12.3396 23.9895 12.2051 23.9606 12.0546C23.9309 11.9046 23.9018 11.7996 23.8727 11.7404Z"
                  fill="white"/>
              </svg>
            </a>
            <a href="/">
              <svg class="telegram" fill="none" height="16" viewBox="0 0 20 16" width="20" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M18.65 0.105204L0.933877 6.62189C-0.275178 7.08512 -0.268184 7.7285 0.71205 8.0154L5.26049 9.36887L15.7843 3.03519C16.2819 2.74638 16.7365 2.90175 16.3628 3.21819L7.83648 10.5584H7.83448L7.83648 10.5594L7.52273 15.0315C7.98237 15.0315 8.18521 14.8304 8.44301 14.5931L10.6523 12.5438L15.2477 15.7817C16.095 16.2268 16.7036 15.998 16.9144 15.0334L19.931 1.47202C20.2398 0.291068 19.4584 -0.243649 18.65 0.105204Z"
                  fill="white"/>
              </svg>
            </a>
          </div>
        </div>

        <div class="mobile flex-column">
          <div class="main-wrap-item">
            <p class="item-title"><b>Наши предложения</b></p>
            <ul class="flex-column">
              <li v-for="(item, id) in recommendationLinks" :key="`recommendation_link_${id}`">
                <nuxt-link class="item-text item-link" exact no-prefetch to="/catalog">
                  {{ item }}
                </nuxt-link>
              </li>
            </ul>
          </div>

          <div class="main-wrap-item">
            <p class="item-title"><b>Поддержка</b></p>
            <ul class="flex-column">
              <li v-for="(item, id) in helpsLinks" :key="`help_link_${id}`">
                <nuxt-link class="item-text item-link" exact no-prefetch :to="item.url">
                  {{ item.title }}
                </nuxt-link>
              </li>
            </ul>
          </div>
        </div>
      </div>

      <div class="additional-wrap flex-align-center">
        <p class="desktop">© 2015-2023.<br>Все права защищены.</p>
        <p>Политика конфиденциальности</p>
        <p>Пользовательское соглашение</p>
        <p>Продукция предназначена <br> для лиц старше 18 лет.</p>
        <p class="mobile">© 2015-2023.<br>Все права защищены.</p>
      </div>
    </div>
  </footer>
</template>

<script>
export default {
  name: "FooterCmp",
  data(){
    return {
      categoriesLinks: [
        'Одноразовые POD-системы',
        'Жидкости для POD-системы',
        'POD-системы',
        'Расходники',
        'Жидкости',
        'Бокс-моды',
        'Атомайзеры',
      ],
      recommendationLinks: [
        'Новинки',
        'Акции',
        'Бренды',
      ],
      helpsLinks: [
        {
          title: 'Оплата',
          url: '/payment',
        },
        {
          title: 'Контакты',
          url: '/contacts',
        },
        {
          title: 'Доставка',
          url: '/delivery',
        },
      ],
    }
  },
}

</script>

<style scoped lang="scss">

.flex-align-end {
  display: flex;
  align-items: flex-end;
}

footer {
  background: $black;
  position: relative;
}

.container {
  position: relative;
}

.mobile-line {
  display: block;
  position: absolute;
  left: 0;
  top: 0;
  width: 100%;
  height: 2px;
  background: $green;
  border-radius: 10px;
}

.item-text {
  @include style-font(16);
  color: #E3E6E4;

  @media screen and (max-width: 768px) {
    @include style-font(14);
  }
}

.item-title {
  @include style-font(20);
  margin-bottom: rem(20);
  color: #FFFFFF;

  @media screen and (max-width: 768px) {
    @include style-font(14);
    margin-bottom: rem(10);
  }
}

.item-link {
  transition: .25s;

  @media screen and (min-width: $laptop) {
    &:hover {
      color: $green;
    }
  }
}

.container {
  padding: rem(90) 0;

  @media screen and (max-width: 768px) {
    padding: rem(60) 0 rem(54);
  }
}

.main-wrap {
  display: flex;
  justify-content: space-between;

  .mobile {
    display: none !important;
  }

  @media screen and (max-width: 768px) {
    flex-wrap: wrap;
    width: 100%;

    .mobile {
      display: flex !important;
      width: 45%;

      p {
        text-align: left !important;
      }
    }

    .recommendation, .help{
      display: none !important;
    }
  }

  &-item {
    min-width: rem(150);
    max-width: rem(270);

    ul {
      gap: rem(10);
    }

    .tel {
      color: #FFFFFF;
      @include style-font(24, 450, 140%, false);
      margin-bottom: rem(40);
    }

    .social {
      display: flex;
      gap: rem(34);

      .vk {
        width: rem(36);
        height: rem(26);
      }

      .telegram {
        width: rem(32);
        height: rem(26);
      }
    }

    @media screen and (max-width: 768px) {
      min-width: auto;
      max-width: none;

      &:first-child {
        margin-bottom: rem(30);
        width: 100%;

        p {
          text-align: center;
        }
      }
      &:nth-child(2) {
        width: 50%;
        margin-bottom: rem(30);
      }

      &.flex-align-end.flex-column {
        display: none !important;
      }
    }
  }

  .logo-wrap {
    gap: rem(10);
    margin-bottom: rem(20);

    .logo {
      width: rem(40);
      height: rem(40);

      @media screen and (max-width: 768px) {
        width: rem(30);
        height: rem(30);
      }
    }

    .logo-word {
      width: rem(154);
      height: rem(40);

      @media screen and (max-width: 768px) {
        width: rem(117);
        height: rem(30);
      }
    }

    @media screen and (max-width: 768px) {
      justify-content: center;
    }
  }
}

.additional-wrap {
  display: flex;
  justify-content: space-between;
  margin-top: rem(28);

  @media screen and (max-width: 768px) {
    flex-direction: column;
    align-items: center;
    justify-content: center;
    text-align: center;
    margin-top: rem(10);
    gap: rem(10);
  }

  .desktop {
    display: block;
    @media screen and (max-width: 768px) {
      display: none;
    }
  }

  .mobile {
    display: none;
    @media screen and (max-width: 768px) {
      display: block;
    }
  }

  p {
    @include style-font(16);
    color: $gray;

    @media screen and (max-width: 768px) {
      @include style-font(12);
    }
  }
}

.logo-text {
  @media screen and (max-width: 769px) {
    width: rem(225);
    text-align: center;
    margin: 0 auto;
  }
}

</style>
