<template>
  <div class="page-background">
    <div v-if="windowWidth > 768" class="bread-crumbs container">
      <bread-crumbs :bread-crumbs="breadCrumbsDelivery"/>
    </div>

    <custom-section :section-info="sectionInfo">
      <main class="container">
        <section>
          <div class="title flex-column">
            <h2>Самовывоз</h2>
            <p>Закажите товар онлайн и заберите в любом из наших магазинов.</p>
          </div>

          <div class="steps">
            <div class="steps-item"><p>Оформление заказа</p></div>

            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
              <g clip-path="url(#clip0_1720_7572)">
                <path d="M18.5313 12.1965C18.6239 12.0882 18.6239 11.9123 18.5313 11.804L16.7059 9.66642L9.01011 0.654031C8.65243 0.235412 8.16758 -2.94335e-07 7.66225 -2.50158e-07L5.03817 -2.07536e-08C4.82718 -2.30756e-09 4.72143 0.299221 4.87055 0.473726L14.5458 11.804C14.6384 11.9123 14.6384 12.0882 14.5458 12.1965L4.87055 23.5263C4.72144 23.7013 4.82718 24 5.03818 24L7.66225 24C8.16807 24 8.65292 23.7646 9.0106 23.346L16.7064 14.3336L18.5318 12.196L18.5313 12.1965Z" fill="#00A689"/>
              </g>
              <defs>
                <clipPath id="clip0_1720_7572">
                  <rect width="24" height="24" fill="white" transform="matrix(-1 8.74228e-08 8.74228e-08 1 24 0)"/>
                </clipPath>
              </defs>
            </svg>

            <div class="steps-item"><p>Подтверждение резервирования товара</p></div>

            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
              <g clip-path="url(#clip0_1720_7572)">
                <path d="M18.5313 12.1965C18.6239 12.0882 18.6239 11.9123 18.5313 11.804L16.7059 9.66642L9.01011 0.654031C8.65243 0.235412 8.16758 -2.94335e-07 7.66225 -2.50158e-07L5.03817 -2.07536e-08C4.82718 -2.30756e-09 4.72143 0.299221 4.87055 0.473726L14.5458 11.804C14.6384 11.9123 14.6384 12.0882 14.5458 12.1965L4.87055 23.5263C4.72144 23.7013 4.82718 24 5.03818 24L7.66225 24C8.16807 24 8.65292 23.7646 9.0106 23.346L16.7064 14.3336L18.5318 12.196L18.5313 12.1965Z" fill="#00A689"/>
              </g>
              <defs>
                <clipPath id="clip0_1720_7572">
                  <rect width="24" height="24" fill="white" transform="matrix(-1 8.74228e-08 8.74228e-08 1 24 0)"/>
                </clipPath>
              </defs>
            </svg>

            <div class="steps-item"><p>Можно забрать в течение 3 дней</p></div>
          </div>

          <div class="map-wrap" v-if="windowWidth > 768">
            <div class="map-list">
              <div class="title flex-align-center">
                <svg fill="none" height="40" viewBox="0 0 40 40" width="40" xmlns="http://www.w3.org/2000/svg">
                  <path d="M38.7671 28.6862L27.6116 11.3071C27.5154 11.6693 27.387 12.0173 27.2286 12.3494L38.0368 29.1872C38.1862 29.3937 38.0726 29.5786 38.0346 29.6303C37.9966 29.6823 37.8534 29.8451 37.6124 29.7608L27.3018 26.1615C27.2037 26.1275 27.1027 26.1088 27.0017 26.0998L24.1548 19.0517C24.0538 19.5661 23.956 20.1363 23.8661 20.701L26.1459 26.3452C26.1212 26.3635 26.0929 26.3751 26.0694 26.3953L20.6395 31.0633L14.2759 13.0005L16.2209 11.9424C16.1121 11.663 16.0225 11.3746 15.9561 11.077L13.8336 12.2318C13.7485 12.2804 13.6461 12.295 13.5514 12.269L7.52322 10.6649C7.1049 10.5546 6.66576 10.6627 6.34772 10.957L0.405799 16.4503C0.0926077 16.7404 -0.0527249 17.1647 0.0172769 17.5855L2.72773 33.9436C2.79991 34.3795 3.08694 34.7393 3.49484 34.9058C3.64962 34.9689 3.81118 35 3.97153 35C4.23386 35 4.49304 34.9167 4.71346 34.7546L12.3047 29.1706C12.4093 29.0934 12.5488 29.0766 12.668 29.1269L19.7585 32.0789C20.1994 32.2621 20.6971 32.1826 21.0597 31.8714L26.6456 27.0693C26.7459 26.9828 26.8854 26.9558 27.0109 27L37.3215 30.5993C37.8522 30.7849 38.41 30.6119 38.7453 30.16C39.0798 29.7078 39.0832 29.1213 38.7673 28.6862H38.7671ZM4.18953 34.0386C4.03839 34.1499 3.88651 34.1071 3.82838 34.0836C3.77049 34.06 3.6317 33.9844 3.60069 33.7981L0.890241 17.4394C0.86941 17.3148 0.912768 17.1892 1.00554 17.1032L6.79946 11.7468L11.8759 28.4026C11.8449 28.4216 11.8103 28.4332 11.7807 28.4549L4.18953 34.0386ZM12.7513 28.2381L7.68866 11.6275L13.3242 13.1269C13.3445 13.1325 13.3653 13.1327 13.3859 13.1371L19.714 31.0988L13.0076 28.3067C12.9247 28.2724 12.8383 28.2535 12.7516 28.2379L12.7513 28.2381Z"
                        fill="black"
                        opacity="0.7"/>
                  <path
                    d="M26.5735 9.77396C26.5735 7.13734 24.4427 5 21.8141 5C19.1855 5 17.0547 7.13734 17.0547 9.77396C17.0547 10.8877 17.4381 11.9101 18.0754 12.7221H18.0708C18.0708 12.7221 18.0846 12.7379 18.104 12.7602C18.1374 12.802 18.1721 12.8423 18.2069 12.8827C18.5618 13.3125 19.5195 14.5457 19.9291 15.7975C20.4366 17.3488 21.0145 22.0997 21.0145 22.0997V22.1305C21.0145 22.5006 21.3137 22.8004 21.6823 22.8004H21.9454C22.3143 22.8004 22.6134 22.5003 22.6134 22.1305V22.0997C22.6134 22.0997 23.1911 17.3488 23.6986 15.7975C24.1082 14.5457 25.0659 13.3125 25.4208 12.8827C25.4556 12.8421 25.4903 12.8018 25.5237 12.7602C25.5431 12.7376 25.5566 12.7221 25.5566 12.7221H25.552C26.1896 11.9098 26.573 10.8877 26.573 9.77396H26.5735ZM21.8141 12.4312C20.3174 12.4312 19.1039 11.2142 19.1039 9.71298C19.1039 8.21172 20.3172 6.99448 21.8141 6.99448C23.311 6.99448 24.5243 8.21147 24.5243 9.71298C24.5243 11.2145 23.311 12.4312 21.8141 12.4312Z"
                    fill="#01A689"/>
                </svg>

                <h3><b>Адреса магазинов</b></h3>
              </div>

              <ul class="flex-column">
                <li class="flex-column">
                  <div class="flex-align-center">
                    <svg fill="none" height="14" viewBox="0 0 14 14" width="14" xmlns="http://www.w3.org/2000/svg">
                      <path
                        d="M4.48879 9.6414L11.8969 1.38484C12.1271 1.12828 12.42 1 12.7758 1C13.1315 1 13.4245 1.12828 13.6547 1.38484C13.8849 1.6414 14 1.96793 14 2.36443C14 2.76093 13.8849 3.08746 13.6547 3.34402L5.36771 12.5802C5.11659 12.8601 4.82362 13 4.48879 13C4.15396 13 3.86099 12.8601 3.60987 12.5802L0.345291 8.94169C0.115097 8.68513 0 8.3586 0 7.9621C0 7.5656 0.115097 7.23907 0.345291 6.98251C0.575485 6.72595 0.86846 6.59767 1.22422 6.59767C1.57997 6.59767 1.87294 6.72595 2.10314 6.98251L4.48879 9.6414Z"
                        fill="#00A689"/>
                    </svg>

                    <p>г. Воронеж, ул. Куколкина, 32</p>
                  </div>
                  <div class="flex-align-center">
                    <svg fill="none" height="14" viewBox="0 0 14 14" width="14" xmlns="http://www.w3.org/2000/svg">
                      <g clip-path="url(#clip0_1404_6478)">
                        <path
                          d="M7 0C3.15 0 0 3.15 0 7C0 10.85 3.15 14 7 14C10.85 14 14 10.85 14 7C14 3.15 10.85 0 7 0ZM10.5 7.7H6.3V3.5H7.35V6.65H10.5V7.7Z"
                          fill="#00A689"/>
                      </g>
                      <defs>
                        <clipPath id="clip0_1404_6478">
                          <rect fill="white" height="14" width="14"/>
                        </clipPath>
                      </defs>
                    </svg>
                    <span>10:00-22:00</span>
                  </div>
                </li>
                <li class="flex-column">
                  <div class="flex-align-center">
                    <svg fill="none" height="14" viewBox="0 0 14 14" width="14" xmlns="http://www.w3.org/2000/svg">
                      <path
                        d="M4.48879 9.6414L11.8969 1.38484C12.1271 1.12828 12.42 1 12.7758 1C13.1315 1 13.4245 1.12828 13.6547 1.38484C13.8849 1.6414 14 1.96793 14 2.36443C14 2.76093 13.8849 3.08746 13.6547 3.34402L5.36771 12.5802C5.11659 12.8601 4.82362 13 4.48879 13C4.15396 13 3.86099 12.8601 3.60987 12.5802L0.345291 8.94169C0.115097 8.68513 0 8.3586 0 7.9621C0 7.5656 0.115097 7.23907 0.345291 6.98251C0.575485 6.72595 0.86846 6.59767 1.22422 6.59767C1.57997 6.59767 1.87294 6.72595 2.10314 6.98251L4.48879 9.6414Z"
                        fill="#00A689"/>
                    </svg>

                    <p>г. Воронеж, ул. Куколкина</p>
                  </div>
                  <div class="flex-align-center">
                    <svg fill="none" height="14" viewBox="0 0 14 14" width="14" xmlns="http://www.w3.org/2000/svg">
                      <g clip-path="url(#clip0_1404_6478)">
                        <path
                          d="M7 0C3.15 0 0 3.15 0 7C0 10.85 3.15 14 7 14C10.85 14 14 10.85 14 7C14 3.15 10.85 0 7 0ZM10.5 7.7H6.3V3.5H7.35V6.65H10.5V7.7Z"
                          fill="#00A689"/>
                      </g>
                      <defs>
                        <clipPath id="clip0_1404_6478">
                          <rect fill="white" height="14" width="14"/>
                        </clipPath>
                      </defs>
                    </svg>
                    <span>10:00-22:00</span>
                  </div>
                </li>
              </ul>

            </div>
            <div class="map">
              <iframe src="https://yandex.ru/map-widget/v1/?um=constructor%3Adc685fd574de778e30c98e971c48e9eb2c2e9e1135257a111be777ff0dd43a49&amp;source=constructor" width="764" height="560" frameborder="0"></iframe>
            </div>
          </div>
        </section>

        <section v-if="windowWidth <= 768">
          <div class="map-list">
            <div class="title flex-align-center">
              <svg fill="none" height="40" viewBox="0 0 40 40" width="40" xmlns="http://www.w3.org/2000/svg">
                <path d="M38.7671 28.6862L27.6116 11.3071C27.5154 11.6693 27.387 12.0173 27.2286 12.3494L38.0368 29.1872C38.1862 29.3937 38.0726 29.5786 38.0346 29.6303C37.9966 29.6823 37.8534 29.8451 37.6124 29.7608L27.3018 26.1615C27.2037 26.1275 27.1027 26.1088 27.0017 26.0998L24.1548 19.0517C24.0538 19.5661 23.956 20.1363 23.8661 20.701L26.1459 26.3452C26.1212 26.3635 26.0929 26.3751 26.0694 26.3953L20.6395 31.0633L14.2759 13.0005L16.2209 11.9424C16.1121 11.663 16.0225 11.3746 15.9561 11.077L13.8336 12.2318C13.7485 12.2804 13.6461 12.295 13.5514 12.269L7.52322 10.6649C7.1049 10.5546 6.66576 10.6627 6.34772 10.957L0.405799 16.4503C0.0926077 16.7404 -0.0527249 17.1647 0.0172769 17.5855L2.72773 33.9436C2.79991 34.3795 3.08694 34.7393 3.49484 34.9058C3.64962 34.9689 3.81118 35 3.97153 35C4.23386 35 4.49304 34.9167 4.71346 34.7546L12.3047 29.1706C12.4093 29.0934 12.5488 29.0766 12.668 29.1269L19.7585 32.0789C20.1994 32.2621 20.6971 32.1826 21.0597 31.8714L26.6456 27.0693C26.7459 26.9828 26.8854 26.9558 27.0109 27L37.3215 30.5993C37.8522 30.7849 38.41 30.6119 38.7453 30.16C39.0798 29.7078 39.0832 29.1213 38.7673 28.6862H38.7671ZM4.18953 34.0386C4.03839 34.1499 3.88651 34.1071 3.82838 34.0836C3.77049 34.06 3.6317 33.9844 3.60069 33.7981L0.890241 17.4394C0.86941 17.3148 0.912768 17.1892 1.00554 17.1032L6.79946 11.7468L11.8759 28.4026C11.8449 28.4216 11.8103 28.4332 11.7807 28.4549L4.18953 34.0386ZM12.7513 28.2381L7.68866 11.6275L13.3242 13.1269C13.3445 13.1325 13.3653 13.1327 13.3859 13.1371L19.714 31.0988L13.0076 28.3067C12.9247 28.2724 12.8383 28.2535 12.7516 28.2379L12.7513 28.2381Z"
                      fill="black"
                      opacity="0.7"/>
                <path
                  d="M26.5735 9.77396C26.5735 7.13734 24.4427 5 21.8141 5C19.1855 5 17.0547 7.13734 17.0547 9.77396C17.0547 10.8877 17.4381 11.9101 18.0754 12.7221H18.0708C18.0708 12.7221 18.0846 12.7379 18.104 12.7602C18.1374 12.802 18.1721 12.8423 18.2069 12.8827C18.5618 13.3125 19.5195 14.5457 19.9291 15.7975C20.4366 17.3488 21.0145 22.0997 21.0145 22.0997V22.1305C21.0145 22.5006 21.3137 22.8004 21.6823 22.8004H21.9454C22.3143 22.8004 22.6134 22.5003 22.6134 22.1305V22.0997C22.6134 22.0997 23.1911 17.3488 23.6986 15.7975C24.1082 14.5457 25.0659 13.3125 25.4208 12.8827C25.4556 12.8421 25.4903 12.8018 25.5237 12.7602C25.5431 12.7376 25.5566 12.7221 25.5566 12.7221H25.552C26.1896 11.9098 26.573 10.8877 26.573 9.77396H26.5735ZM21.8141 12.4312C20.3174 12.4312 19.1039 11.2142 19.1039 9.71298C19.1039 8.21172 20.3172 6.99448 21.8141 6.99448C23.311 6.99448 24.5243 8.21147 24.5243 9.71298C24.5243 11.2145 23.311 12.4312 21.8141 12.4312Z"
                  fill="#01A689"/>
              </svg>

              <h3><b>Адреса магазинов</b></h3>
            </div>

            <ul class="flex-column">
              <li class="flex-column">
                <div class="flex-align-center">
                  <svg fill="none" height="14" viewBox="0 0 14 14" width="14" xmlns="http://www.w3.org/2000/svg">
                    <path
                      d="M4.48879 9.6414L11.8969 1.38484C12.1271 1.12828 12.42 1 12.7758 1C13.1315 1 13.4245 1.12828 13.6547 1.38484C13.8849 1.6414 14 1.96793 14 2.36443C14 2.76093 13.8849 3.08746 13.6547 3.34402L5.36771 12.5802C5.11659 12.8601 4.82362 13 4.48879 13C4.15396 13 3.86099 12.8601 3.60987 12.5802L0.345291 8.94169C0.115097 8.68513 0 8.3586 0 7.9621C0 7.5656 0.115097 7.23907 0.345291 6.98251C0.575485 6.72595 0.86846 6.59767 1.22422 6.59767C1.57997 6.59767 1.87294 6.72595 2.10314 6.98251L4.48879 9.6414Z"
                      fill="#00A689"/>
                  </svg>

                  <p>г. Воронеж, ул. Куколкина, 32</p>
                </div>
                <div class="flex-align-center">
                  <svg fill="none" height="14" viewBox="0 0 14 14" width="14" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_1404_6478)">
                      <path
                        d="M7 0C3.15 0 0 3.15 0 7C0 10.85 3.15 14 7 14C10.85 14 14 10.85 14 7C14 3.15 10.85 0 7 0ZM10.5 7.7H6.3V3.5H7.35V6.65H10.5V7.7Z"
                        fill="#00A689"/>
                    </g>
                    <defs>
                      <clipPath id="clip0_1404_6478">
                        <rect fill="white" height="14" width="14"/>
                      </clipPath>
                    </defs>
                  </svg>
                  <span>10:00-22:00</span>
                </div>
              </li>
              <li class="flex-column">
                <div class="flex-align-center">
                  <svg fill="none" height="14" viewBox="0 0 14 14" width="14" xmlns="http://www.w3.org/2000/svg">
                    <path
                      d="M4.48879 9.6414L11.8969 1.38484C12.1271 1.12828 12.42 1 12.7758 1C13.1315 1 13.4245 1.12828 13.6547 1.38484C13.8849 1.6414 14 1.96793 14 2.36443C14 2.76093 13.8849 3.08746 13.6547 3.34402L5.36771 12.5802C5.11659 12.8601 4.82362 13 4.48879 13C4.15396 13 3.86099 12.8601 3.60987 12.5802L0.345291 8.94169C0.115097 8.68513 0 8.3586 0 7.9621C0 7.5656 0.115097 7.23907 0.345291 6.98251C0.575485 6.72595 0.86846 6.59767 1.22422 6.59767C1.57997 6.59767 1.87294 6.72595 2.10314 6.98251L4.48879 9.6414Z"
                      fill="#00A689"/>
                  </svg>

                  <p>г. Воронеж, ул. Куколкина, 32</p>
                </div>
                <div class="flex-align-center">
                  <svg fill="none" height="14" viewBox="0 0 14 14" width="14" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_1404_6478)">
                      <path
                        d="M7 0C3.15 0 0 3.15 0 7C0 10.85 3.15 14 7 14C10.85 14 14 10.85 14 7C14 3.15 10.85 0 7 0ZM10.5 7.7H6.3V3.5H7.35V6.65H10.5V7.7Z"
                        fill="#00A689"/>
                    </g>
                    <defs>
                      <clipPath id="clip0_1404_6478">
                        <rect fill="white" height="14" width="14"/>
                      </clipPath>
                    </defs>
                  </svg>
                  <span>10:00-22:00</span>
                </div>
              </li>
            </ul>

          </div>
        </section>

        <section v-if="windowWidth <= 768" class="mobile-map">
          <iframe src="https://yandex.ru/map-widget/v1/?um=constructor%3Adc685fd574de778e30c98e971c48e9eb2c2e9e1135257a111be777ff0dd43a49&amp;source=constructor" width="764" height="560" frameborder="0"></iframe>
        </section>

        <section>
          <div class="title flex-column">
            <h2><b>Доставка по Липецку</b></h2>
            <p>Заказы через интернет-магазин принимаются круглосуточно. Интервал доставки с вами согласует менеджер при звонке для подтверждения заказа.</p>
          </div>
          <div class="card-wrap">
            <article class="card">
              <div class="card-title">
                <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M31.4412 5H8.55882C6.59653 5 5 6.59653 5 8.55882V31.4412C5 33.4035 6.59653 35 8.55882 35H31.4412C33.4035 35 35 33.4035 35 31.4412V8.55882C35 6.59653 33.4035 5 31.4412 5ZM33.2353 31.4412C33.2353 32.4304 32.4304 33.2353 31.4412 33.2353H8.55882C7.56959 33.2353 6.76471 32.4304 6.76471 31.4412V8.55882C6.76471 7.56959 7.56959 6.76471 8.55882 6.76471H31.4412C32.4304 6.76471 33.2353 7.56959 33.2353 8.55882V31.4412Z" fill="black"/>
                  <path d="M20.0018 8.52941C13.677 8.52941 8.53125 13.6751 8.53125 20C8.53125 26.3249 13.677 31.4706 20.0018 31.4706C26.3267 31.4706 31.4724 26.3249 31.4724 20C31.4724 13.6751 26.3267 8.52941 20.0018 8.52941ZM29.6671 20.8824C29.4847 22.8971 28.6844 24.736 27.4571 26.2075L26.241 24.9913L24.9931 26.2391L26.2093 27.4553C24.7378 28.6825 22.8989 29.4829 20.8842 29.6653V27.9412H19.1195V29.6654C17.1048 29.4829 15.2658 28.6826 13.7944 27.4554L15.0105 26.2392L13.7627 24.9914L12.5465 26.2075C11.3192 24.736 10.5189 22.8971 10.3365 20.8824H12.0607V19.1176H10.3365C10.5189 17.1029 11.3193 15.264 12.5465 13.7925L13.7627 15.0087L15.0105 13.7609L13.7943 12.5447C15.2658 11.3175 17.1047 10.5171 19.1194 10.3347V12.0588H20.8841V10.3346C22.8988 10.5171 24.7378 11.3174 26.2093 12.5446L24.9931 13.7608L26.2409 15.0086L27.4571 13.7925C28.6843 15.264 29.4847 17.1029 29.6671 19.1176H27.943V20.8823H29.6671V20.8824Z" fill="black"/>
                  <path d="M20.8819 15.5882H19.1172V20.5454L23.1344 22.5539L23.9235 20.9755L20.8819 19.4547V15.5882Z" fill="black"/>
                </svg>
                <h6>
                  <b>
                    Время обработки заказов: 10:00 — 19:00
                  </b>
                </h6>
              </div>
              <ul class="card-list">
                <li>
                  <svg width="29" height="29" viewBox="0 0 29 29" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M12.4888 17.6414L19.8969 9.38484C20.1271 9.12828 20.42 9 20.7758 9C21.1315 9 21.4245 9.12828 21.6547 9.38484C21.8849 9.6414 22 9.96793 22 10.3644C22 10.7609 21.8849 11.0875 21.6547 11.344L13.3677 20.5802C13.1166 20.8601 12.8236 21 12.4888 21C12.154 21 11.861 20.8601 11.6099 20.5802L8.34529 16.9417C8.1151 16.6851 8 16.3586 8 15.9621C8 15.5656 8.1151 15.2391 8.34529 14.9825C8.57549 14.7259 8.86846 14.5977 9.22422 14.5977C9.57997 14.5977 9.87294 14.7259 10.1031 14.9825L12.4888 17.6414Z" fill="#00A689"/>
                  </svg>

                  <p>
                    Если вы оформили заказ поздно вечером/ночью/рано утром, он будет обработан в первые два часа работы интернет-магазина.
                  </p>
                </li>
              </ul>
            </article>
            <article class="card">
              <div class="card-title">
                <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M32.1456 12.8852C31.332 11.6652 29.466 10.6664 28 10.6664H25.3332V5.3332H4V8H22.6668V29.3332H11.7564C11.2052 27.7824 9.7396 26.6668 8.0012 26.6668C5.7904 26.6668 4.0012 28.4572 4.0012 30.6668C4.0012 32.876 5.7904 34.6668 8.0012 34.6668C9.7396 34.6668 11.2048 33.5508 11.7564 32H24.2448C24.7968 33.5508 26.2616 34.6668 28 34.6668C29.7384 34.6668 31.2032 33.5508 31.7552 32H36V19.3332L32.1456 12.8852ZM8.0012 32C7.82608 32.0002 7.65264 31.9658 7.49082 31.8988C7.329 31.8319 7.18196 31.7337 7.05813 31.6099C6.9343 31.486 6.83611 31.339 6.76916 31.1772C6.70222 31.0154 6.66784 30.8419 6.668 30.6668C6.66789 30.4917 6.7023 30.3182 6.76926 30.1564C6.83622 29.9946 6.93441 29.8476 7.05823 29.7237C7.18204 29.5999 7.32905 29.5016 7.49085 29.4346C7.65265 29.3676 7.82607 29.3331 8.0012 29.3332C8.35479 29.3334 8.69383 29.474 8.94382 29.7241C9.19381 29.9741 9.33429 30.3132 9.3344 30.6668C9.33419 31.0203 9.19366 31.3593 8.94368 31.6093C8.6937 31.8593 8.35472 31.9998 8.0012 32ZM28 32C27.8249 32.0002 27.6514 31.9658 27.4896 31.8988C27.3278 31.8319 27.1808 31.7337 27.0569 31.6099C26.9331 31.486 26.8349 31.339 26.768 31.1772C26.701 31.0154 26.6666 30.8419 26.6668 30.6668C26.6668 29.9296 27.2628 29.3332 28 29.3332C28.7372 29.3332 29.3332 29.9296 29.3332 30.6668C29.3334 30.8419 29.299 31.0154 29.232 31.1772C29.1651 31.339 29.0669 31.486 28.9431 31.6099C28.8192 31.7337 28.6722 31.8319 28.5104 31.8988C28.3486 31.9658 28.1751 32.0002 28 32ZM33.3332 29.3332H31.7552C31.2032 27.7824 29.7384 26.6668 28 26.6668C26.9716 26.6668 26.0416 27.0664 25.3332 27.7044V22.6668H33.3332V29.3332ZM25.3332 20V13.3332H28C28.5792 13.3332 29.6056 13.8828 29.8568 14.254L33.3332 20H25.3332Z" fill="black"/>
                  <path d="M4 17H6.6668V19H4V17ZM17.3332 17H20V19H17.3332V17ZM11 23.3332H13V26H11V23.3332ZM11 10H13V12.6664H11V10Z" fill="black"/>
                  <path d="M7.05078 14.9356L8.46478 13.5216L11.9516 16.3752L17.4204 11.6352L18.8332 13.05L12 19.884L7.05078 14.9356Z" fill="black"/>
                </svg>

                <h6>
                  <b>
                    Время обработки заказов: 10:00 — 19:00
                  </b>
                </h6>
              </div>
              <ul class="card-list">
                <li>
                  <svg width="29" height="29" viewBox="0 0 29 29" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M12.4888 17.6414L19.8969 9.38484C20.1271 9.12828 20.42 9 20.7758 9C21.1315 9 21.4245 9.12828 21.6547 9.38484C21.8849 9.6414 22 9.96793 22 10.3644C22 10.7609 21.8849 11.0875 21.6547 11.344L13.3677 20.5802C13.1166 20.8601 12.8236 21 12.4888 21C12.154 21 11.861 20.8601 11.6099 20.5802L8.34529 16.9417C8.1151 16.6851 8 16.3586 8 15.9621C8 15.5656 8.1151 15.2391 8.34529 14.9825C8.57549 14.7259 8.86846 14.5977 9.22422 14.5977C9.57997 14.5977 9.87294 14.7259 10.1031 14.9825L12.4888 17.6414Z" fill="#00A689"/>
                  </svg>

                  <p>
                    Если вы оформили заказ до 18:00, мы почти всегда сможем доставить его в день заказа.
                  </p>
                </li>
              </ul>
            </article>
          </div>
          <article class="alert" v-if="windowWidth > 768">
            <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M3.33268 11.6667L1.66602 20V23.3333H3.33268V33.3333H19.9993V23.3333H26.666V33.3333H29.9993V23.3333H31.666V20L29.9993 11.6667H3.33268ZM16.666 30H6.66602V23.3333H16.666V30ZM29.9993 9.99999H3.33268V6.66666H29.9993V9.99999ZM38.3327 11.6667V21.6667H34.9994V11.6667H38.3327ZM34.9994 25H38.3327V28.3333H34.9994V25Z" fill="white"/>
            </svg>
            <p>Обратите внимание: доставка возможна не для всех товаров.</p>
          </article>
        </section>

        <article class="alert" v-if="windowWidth <= 768">
          <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M3.33268 11.6667L1.66602 20V23.3333H3.33268V33.3333H19.9993V23.3333H26.666V33.3333H29.9993V23.3333H31.666V20L29.9993 11.6667H3.33268ZM16.666 30H6.66602V23.3333H16.666V30ZM29.9993 9.99999H3.33268V6.66666H29.9993V9.99999ZM38.3327 11.6667V21.6667H34.9994V11.6667H38.3327ZM34.9994 25H38.3327V28.3333H34.9994V25Z" fill="white"/>
          </svg>
          <p>Обратите внимание: доставка возможна не для всех товаров.</p>
        </article>

        <section>
          <div class="title flex-column">
            <h2><b>Доставка по России</b></h2>
            <p>
              При оформлении заказа в другие регионы, мы отправим ваш заказ транспортной компанией «СДЭК» или Почтой России.
            </p>
          </div>
          <div class="card-wrap">
            <article class="card">
              <div class="card-title">
                <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M5 36H23.7869C24.1723 35.9938 24.5516 35.9026 24.8975 35.7327C25.2433 35.5629 25.547 35.3187 25.7869 35.0177L31.3389 28.3733C32.3535 27.0925 32.2639 25.2615 31.1289 24.0856C29.9304 22.9243 28.0164 22.9461 26.8449 24.1346C26.0022 20.4957 22.7691 17.9063 19.0239 17.8708H18.938C15.5955 17.8803 12.6006 19.931 11.3909 23.0377H10C10 22.487 9.55225 22.0406 9 22.0406H5C4.4475 22.0406 4 22.487 4 23.0377V35.0029C4 35.5535 4.4475 36 5 36ZM18.938 19.8608H19C22.3828 19.8964 25.0959 22.6598 25.0598 26.0329C25.0598 26.0909 25.0529 26.1488 25.0508 26.2065L21.782 29.9955H16.25L15.709 29.5597L18.5998 29.0203C20.2568 28.9928 21.5774 27.6312 21.5498 25.9791C21.5222 24.3271 20.1567 23.0102 18.5 23.0377H13.583C14.6545 21.0856 16.7058 19.8686 18.938 19.8608ZM18.5 25.0319C19.0522 25.0319 19.5 25.4783 19.5 26.029C19.5 26.5796 19.0522 27.0261 18.5 27.0261C18.4375 27.0261 18.3752 27.0322 18.3139 27.0442L13.2139 28.0093C13.0263 28.0448 12.8528 28.1331 12.7139 28.2637C12.5751 28.3944 12.4767 28.562 12.4303 28.7466C12.3839 28.9313 12.3915 29.1254 12.4522 29.3059C12.513 29.4864 12.6243 29.6457 12.7729 29.7652L15.2729 31.7742C15.4502 31.9176 15.6716 31.9958 15.8999 31.9955H22.2439C22.3875 31.9953 22.5294 31.9641 22.6599 31.9043C22.7903 31.8444 22.9064 31.7572 23 31.6486L28.2998 25.4956C28.6962 25.121 29.3173 25.121 29.7139 25.4956C30.1272 25.9404 30.1633 26.6159 29.7998 27.1018L24.25 33.7456C24.1963 33.8203 24.1268 33.8823 24.0465 33.9273C23.9661 33.9722 23.8768 33.999 23.7849 34.0058H10V25.0319H18.5ZM6 24.0348H8V34.0058H6V24.0348ZM13.0669 15.9581L18.0998 11.9929H18.6628C18.5085 12.4359 18.4608 12.9089 18.5235 13.3738C18.5863 13.8386 18.7578 14.2821 19.0242 14.6687C19.2906 15.0552 19.6444 15.3739 20.0571 15.5989C20.4698 15.824 20.9298 15.9491 21.3999 15.9643L26.8198 16.9464C26.8793 16.9572 26.9396 16.9625 27 16.9623H30C30 17.513 30.4475 17.9594 31 17.9594H35C35.5523 17.9594 36 17.513 36 16.9623V4.9971C36 4.44645 35.5523 4 35 4H16.25V4.9971L16.2129 4C15.8275 4.00621 15.4483 4.09742 15.1026 4.26708C14.7568 4.43674 14.4529 4.68064 14.2129 4.98127L8.66288 11.6257C7.64769 12.9062 7.73756 14.7376 8.87281 15.9134C10.0427 17.0227 11.8735 17.0424 13.0669 15.9581ZM34 15.9652H32V5.9942H34V15.9652ZM10.1999 12.8991L15.7499 6.25438C15.8035 6.18026 15.8727 6.11872 15.9527 6.07411C16.0327 6.02949 16.1215 6.00288 16.2129 5.99614H30V14.9701H27.0898L21.6789 13.989C21.6199 13.9786 21.5598 13.9735 21.5 13.973C20.9822 13.9735 20.5496 13.5798 20.5031 13.0654C20.4566 12.5513 20.8113 12.0868 21.3208 11.9948L26.5939 12.0107H26.5998C27.1521 12.0123 27.6013 11.5673 27.6027 11.0167C27.6045 10.4658 27.1582 10.0181 26.6059 10.0165L21.5 9.98454C21.3999 9.98454 21.2908 9.99065 21.1899 10.0006H17.7559C17.5308 10.0007 17.3124 10.0767 17.136 10.2161L11.7859 14.4296C11.7559 14.4537 11.7268 14.4795 11.699 14.5065C11.3025 14.8809 10.6814 14.8809 10.2849 14.5065C9.87081 14.0616 9.83519 13.385 10.1999 12.8991Z" fill="black"/>
                </svg>
                <h6>
                  <b>
                    Минимальная сумма заказа
                    — 500 рублей
                  </b>
                </h6>
              </div>
              <ul class="card-list">
                <li>
                  <svg width="29" height="29" viewBox="0 0 29 29" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M12.4888 17.6414L19.8969 9.38484C20.1271 9.12828 20.42 9 20.7758 9C21.1315 9 21.4245 9.12828 21.6547 9.38484C21.8849 9.6414 22 9.96793 22 10.3644C22 10.7609 21.8849 11.0875 21.6547 11.344L13.3677 20.5802C13.1166 20.8601 12.8236 21 12.4888 21C12.154 21 11.861 20.8601 11.6099 20.5802L8.34529 16.9417C8.1151 16.6851 8 16.3586 8 15.9621C8 15.5656 8.1151 15.2391 8.34529 14.9825C8.57549 14.7259 8.86846 14.5977 9.22422 14.5977C9.57997 14.5977 9.87294 14.7259 10.1031 14.9825L12.4888 17.6414Z" fill="#00A689"/>
                  </svg>

                  <p>
                    Стоимость доставки рассчитает и сообщит менеджер, при звонке для согласования заказа. Доставка СДЭК оплачивается при получении в пункте выдачи, Почтой России — одновременно с оплатой заказа, до отправления.
                  </p>
                </li>
              </ul>
            </article>
            <article class="card">
              <div class="card-title">
                <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M8.6137 2L4 9.06338V38H35V9.06338L30.3863 2H8.6137ZM32.0359 8.32812H24.3782L23.0005 4.10938H29.2804L32.0359 8.32812ZM16.4 10.4375H22.6V14.7969H16.4V10.4375ZM16.8005 8.32812L18.1782 4.10938H20.8218L22.1996 8.32812H16.8005ZM9.71964 4.10938H15.9995L14.6218 8.32812H6.96415L9.71964 4.10938ZM6.06667 35.8906V10.4375H14.3333V16.9062H24.6667V10.4375H32.9333V35.8906H6.06667Z" fill="black"/>
                  <path d="M13.9855 29.8113H16.1913V25.0093L17.6174 26.3629L19.1769 24.8822L15.0884 21L11 24.8822L12.5595 26.3629L13.9855 25.0093V29.8113ZM19.8231 24.8822L21.3826 26.3629L22.8087 25.0093V29.8113H25.0145V25.0093L26.4405 26.3629L28 24.8822L23.9116 21L19.8231 24.8822ZM13.9855 31.9056H25.0145V34H13.9855V31.9056Z" fill="black"/>
                </svg>

                <h6>
                  <b>
                    Заказ отправляется
                    после 100% предоплаты
                  </b>
                </h6>
              </div>
              <ul class="card-list">
                <li>
                  <svg width="29" height="29" viewBox="0 0 29 29" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M12.4888 17.6414L19.8969 9.38484C20.1271 9.12828 20.42 9 20.7758 9C21.1315 9 21.4245 9.12828 21.6547 9.38484C21.8849 9.6414 22 9.96793 22 10.3644C22 10.7609 21.8849 11.0875 21.6547 11.344L13.3677 20.5802C13.1166 20.8601 12.8236 21 12.4888 21C12.154 21 11.861 20.8601 11.6099 20.5802L8.34529 16.9417C8.1151 16.6851 8 16.3586 8 15.9621C8 15.5656 8.1151 15.2391 8.34529 14.9825C8.57549 14.7259 8.86846 14.5977 9.22422 14.5977C9.57997 14.5977 9.87294 14.7259 10.1031 14.9825L12.4888 17.6414Z" fill="#00A689"/>
                  </svg>

                  <p>
                    Предоплата вносится после согласования заказа с менеджером. После оформления заказа, мы свяжемся с вами для подтверждения и согласования всех деталей.
                  </p>
                </li>
              </ul>
            </article>
          </div>
          <article class="alert" v-if="windowWidth > 768">
            <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M3.33268 11.6667L1.66602 20V23.3333H3.33268V33.3333H19.9993V23.3333H26.666V33.3333H29.9993V23.3333H31.666V20L29.9993 11.6667H3.33268ZM16.666 30H6.66602V23.3333H16.666V30ZM29.9993 9.99999H3.33268V6.66666H29.9993V9.99999ZM38.3327 11.6667V21.6667H34.9994V11.6667H38.3327ZM34.9994 25H38.3327V28.3333H34.9994V25Z" fill="white"/>
            </svg>
            <p>Обратите внимание: доставка возможна не для всех товаров.</p>
          </article>
        </section>

        <article class="alert" v-if="windowWidth <= 768">
          <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M3.33268 11.6667L1.66602 20V23.3333H3.33268V33.3333H19.9993V23.3333H26.666V33.3333H29.9993V23.3333H31.666V20L29.9993 11.6667H3.33268ZM16.666 30H6.66602V23.3333H16.666V30ZM29.9993 9.99999H3.33268V6.66666H29.9993V9.99999ZM38.3327 11.6667V21.6667H34.9994V11.6667H38.3327ZM34.9994 25H38.3327V28.3333H34.9994V25Z" fill="white"/>
          </svg>
          <p>Обратите внимание: доставка возможна не для всех товаров.</p>
        </article>

      </main>
    </custom-section>
  </div>
</template>

<script>
import BreadCrumbs from "../components/BreadCrumbs";
import CustomSection from "../components/CustomSection";
import clientData from "../mixins/clientData";

export default {
  name: "delivery",
  components: {CustomSection, BreadCrumbs},
  mixins: [clientData],
  data() {
    return {
      sectionInfo: {
        url: this.$route.fullPath,
        title: 'доставка'
      },
      breadCrumbsDelivery: [
        {
          url: '/',
          title: 'Главная',
        },
        {
          url: this.$route.fullPath,
          title: 'Доставка',
        },
      ],
    }
  },
}
</script>

<style lang="scss" scoped>

.page-section {
  padding: rem(150) 0 rem(182);

  @media screen and (max-width: 768px) {
    padding: rem(90) 0 rem(30);
  }
}

.map-list {
  width: rem(450);

  @media screen and (max-width: 768px) {
    width: 100%;
  }

  .title {
    gap: rem(10);
    margin-bottom: rem(20);

    svg {
      width: rem(48);
      height: rem(48);
    }
  }

  h3 {
    @include style-font(24, 450, 140%, false);

    @media screen and (max-width: 768px) {
      @include style-font(18, 450, 140%, false);
    }
  }

  ul {
    gap: rem(25);
  }

  li {
    gap: rem(4);

    @media screen and (max-width: 768px) {
      gap: rem(5);
    }

    .flex-align-center {
      @media screen and (max-width: 768px) {
        align-items: baseline !important;
      }
    }
  }

  svg {
    width: rem(14);
    height: rem(14);
    margin-right: rem(10);
  }

  p {
    @include style-font(20);
    max-width: 90%;

    @media screen and (max-width: 768px) {
      width: 80%;
      @include style-font(16);
    }
  }

  span {
    @include style-font(16);
    color: rgba(138, 146, 143, 1);

    @media screen and (max-width: 768px) {
      width: 80%;
    }
  }
}

main {
  display: flex;
  flex-direction: column;
  gap: rem(20);

  * {
    color: $black;
  }

  section {
    background: #FFFFFF;
    box-shadow: 4px 4px 8px 4px rgba(69, 99, 86, 0.3);
    border-radius: 10px;
    padding: rem(30) rem(40) rem(50);

    @media screen and (max-width: 768px) {
      padding: rem(20) rem(30) rem(40);
    }

    &:first-child {
      padding-bottom: rem(60);

      @media screen and (max-width: 768px) {
        padding-bottom: rem(20);
      }

      h2 {
        font-size: rem(24) !important;
        font-weight: 750 !important;
        line-height: 140% !important;
        font-family: 'Avenir Next Cyr' ,serif !important;
      }
    }

    .title {
      max-width: 60%;
      margin-bottom: rem(37);

      @media screen and (max-width: 768px) {
        max-width: none;
        margin-bottom: rem(30);
      }

      h2 {
        color: $green;
        @include style-font(24, 450, 140%, false);
        text-transform: uppercase;

        b {
          color: $green;
        }
      }

      p {
        color: $black;
        @include style-font(16);
      }
    }

    .steps {
      display: flex;
      align-items: center;
      margin-bottom: rem(40);
      gap: rem(10);

      @media screen and (max-width: 768px) {
        flex-direction: column;
      }

      &-item {
        border: 1px solid #00A689;
        box-shadow: 4px 4px 8px 4px rgba(69, 99, 86, 0.3);
        border-radius: 40px;
        padding: rem(14) rem(40);
        @include style-font(16);

        @media screen and (max-width: 768px) {
          height: rem(78);
          width: 100%;
          text-align: center;
          padding: rem(10) rem(30);
          display: flex;
          align-items: center;
          justify-content: center;
        }
      }

      svg {
        width: rem(24);
        height: rem(24);

        @media screen and (max-width: 768px) {
          transform: rotate(90deg);
        }
      }
    }

    .map-wrap {
      display: flex;
      border: 1px solid #00A689;
      box-shadow: 4px 4px 8px 4px rgba(69, 99, 86, 0.3);
      border-radius: 10px;
      padding: rem(40);
      gap: rem(20);

      .title {
        max-width: none;
      }

      .map {
        flex: 1;
        height: rem(378);

        iframe {
          width: 100%;
          height: 100%;
          border-radius: 10px;
        }
      }
    }
  }
}

.card-wrap {
  display: flex;
  align-items: stretch;
  gap: rem(20);

  @media screen and (max-width: 768px) {
    flex-direction: column;
  }

  article {
    flex: 1;
    border: 1px solid #B4B7B6;
    box-shadow: 4px 4px 8px 4px rgba(69, 99, 86, 0.3);
    border-radius: 10px;
    padding: rem(30) rem(20);
    flex-direction: column;
    display: flex;
    justify-content: space-between;
    min-height: rem(180);
  }

  .card-title {
    display: flex;
    align-items: center;
    gap: rem(8);
    margin-bottom: rem(20);

    @media screen and (max-width: 768px){
      margin-bottom: 0;
    }

    h6 {
      @include style-font(16);

      @media screen and (max-width: 768px) {
        width: 80%;
        margin-bottom: rem(10);
      }
    }

    svg {
      width: rem(30);
      height: rem(30);
    }
  }

  ul {
    display: flex;
    flex-direction: column;

    li {
      display: flex;

      svg {
        width: rem(29);
        height: rem(29);
        margin-top: rem(-4);
      }

      p {
        color: rgba(138, 146, 143, 1);
        @include style-font(16);
        width: 90%;
      }
    }
  }
}

.alert {
  width: 100%;
  background: $green;
  color: #FFFFFF;
  box-shadow: 4px 4px 8px 4px rgba(69, 99, 86, 0.3);
  border-radius: 10px;
  padding: rem(30) rem(40);
  display: flex;
  align-items: center;
  gap: rem(10);
  margin-top: rem(20);

  @media screen and (max-width: 768px) {
    padding: rem(24) rem(30) rem(30);
    align-items: flex-start;
    margin-top: 0;
    margin-bottom: rem(20);
  }

  p {
    color: #FFFFFF;
    @include style-font();

    @media screen and (max-width: 768px) {
      @include style-font(16);
      width: 80%;
    }
  }

  svg {
    width: rem(40);
    height: rem(40);
  }
}

.mobile-map {
  padding: 0;

  iframe {
    width: 100%;
    height: rem(560);
    border-radius: 10px;
  }
}

</style>
